{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Good day",
        "Hey",
        "Is anyone there?"
      ],
      "responses": [
        "Hello, how can I assist you today? Need help reporting an incident or viewing safety information?",
        "Hi there, what would you like to report or check?",
        "Good day! How can I help you with reporting incidents or safety updates?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Goodbye", "See you later", "Thanks, bye", "Bye"],
      "responses": [
        "Take care, stay safe! Don't hesitate to report any incidents.",
        "Goodbye! If you need help with anything else, feel free to ask.",
        "Bye! Stay informed and stay safe!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thank you", "Thanks a lot", "Much appreciated", "Thanks"],
      "responses": [
        "You're welcome! Stay safe out there.",
        "Happy to help, take care!",
        "Glad I could assist. Stay informed!"
      ]
    },
    {
      "tag": "report_incident",
      "patterns": [
        "I want to report an incident",
        "How do I report something?",
        "Can I report an incident?",
        "I witnessed something suspicious",
        "I need to report a crime"
      ],
      "responses": [
        "You can report an incident by going to the 'Report Incident' page. Be sure to select the type, severity, and location, and feel free to upload photos or videos.",
        "To report something, head to the 'Report Incident' section on the map, where you can drop a pin and describe the incident."
      ]
    },
    {
      "tag": "safety_heatmap",
      "patterns": [
        "Can I see the safety map?",
        "Show me the heatmap",
        "How do I check the safety in my area?",
        "Where are high-risk zones?",
        "Show me the safety heatmap"
      ],
      "responses": [
        "You can view the real-time safety heatmap by visiting the 'Heatmap' page. It shows areas with high incident density, color-coded by risk levels.",
        "Check the safety heatmap to see which areas have been reported as high-risk or safer zones."
      ]
    },
    {
      "tag": "incident_history_trends",
      "patterns": [
        "What are the crime trends in my area?",
        "Can I see the history of incidents?",
        "Show me the incident data over time",
        "How safe has this neighborhood been historically?"
      ],
      "responses": [
        "You can view the incident history and safety trends by going to the 'Incident History' section, where you can sort data by type, time, and location.",
        "The 'Incident History' page offers insights into safety trends over time, including common types of incidents in various neighborhoods."
      ]
    },
    {
      "tag": "route_safety_score",
      "patterns": [
        "Can I check the safety of my route?",
        "How safe is my travel route?",
        "Is this route safe to walk?",
        "What’s the safety score of my commute?"
      ],
      "responses": [
        "You can check the safety score of your route by entering your start and end points on the 'Route Safety' page. The system will suggest safer routes based on real-time data.",
        "For safe travel routes, use the 'Route Safety' feature, where we provide recommendations based on the current safety data."
      ]
    },
    {
      "tag": "incident_verification_feedback",
      "patterns": [
        "Can I verify incidents?",
        "How do I give feedback on a report?",
        "Can I comment on an incident?",
        "How do I validate a report?"
      ],
      "responses": [
        "You can verify incidents or provide feedback by visiting the incident report and adding your comment or voting on its validity.",
        "To give feedback or validate a report, click on the incident and use the 'Community Feedback' option to contribute your insights."
      ]
    },
    {
      "tag": "admin_dashboard",
      "patterns": [
        "How do I access the admin dashboard?",
        "Can I review incidents as an admin?",
        "Where is the admin panel?",
        "How do I manage reports as an admin?"
      ],
      "responses": [
        "Admins can access the dashboard from the 'Admin' page, where they can review, approve, or remove incident reports and manage users.",
        "If you're an admin, go to the 'Admin Dashboard' to see flagged incidents and manage reports."
      ]
    },
    {
      "tag": "notifications",
      "patterns": [
        "Are there any new incidents near me?",
        "Can I get alerts for nearby incidents?",
        "How do I stay updated on new reports?",
        "Send me safety notifications"
      ],
      "responses": [
        "You can enable push notifications in your account settings to receive real-time alerts for nearby incidents.",
        "Stay informed by turning on notifications for recent incident reports in your area through the 'Notifications' page."
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Can you help me?",
        "I need assistance with the app",
        "How do I use this feature?",
        "I’m not sure what to do"
      ],
      "responses": [
        "I'm here to help! Let me know which feature you'd like assistance with.",
        "Sure, I can help. What exactly do you need assistance with? Reporting incidents, checking safety data, or something else?"
      ]
    }
  ]
}
